swagger/src/Catalogs/Ресурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Ресурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>URL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРесурса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРесурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийФайл</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгруженВСетевуюПапку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьВеб</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстовыйФайл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

swagger/src/Enums/ВидыРесурса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>ВидыРесурса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Стиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Скрипт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изображение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

swagger/src/Catalogs/Ресурсы/Ext/ManagerModule.bsl
Функция СоздатьКаталоги(Путь) Экспорт 
	ПапкаСсылка = Справочники.Ресурсы.НайтиПоРеквизиту("ПутьВеб", СтрЗаменить(Путь, "\", "/"));
	Если Не ПапкаСсылка.Пустая() Тогда
		Возврат ПапкаСсылка;
	КонецЕсли;
	
	Папки = СтрРазделить(Путь, "\", Ложь);
	
	Родитель = Неопределено;
	Для каждого ТекПапка Из Папки Цикл
		ПапкаСсылка = СоздатьКаталогРесурса(ТекПапка, Родитель);
		
		Родитель = ПапкаСсылка;
	КонецЦикла; 
	
	Возврат ПапкаСсылка;
КонецФункции

Функция СоздатьКаталогРесурса(Имя, Родитель = Неопределено)
	Путь = "";
	Если Родитель <> Неопределено Тогда
		Путь = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "ПутьВеб");
	КонецЕсли;
	Путь = Путь + "\" + Имя;
	
	ПапкаСсылка = Справочники.Ресурсы.НайтиПоРеквизиту("ПутьВеб", СтрЗаменить(Путь, "\", "/"));
	Если Не ПапкаСсылка.Пустая() Тогда
		Возврат ПапкаСсылка;
	КонецЕсли;
	
	ПапкаОбъект = Справочники.Ресурсы.СоздатьГруппу();
	ПапкаОбъект.Наименование = Имя;
	ПапкаОбъект.Родитель = Родитель;
	ПапкаОбъект.Записать();
	
	Возврат ПапкаОбъект.Ссылка;
КонецФункции

Функция СоздатьРесурс(АдресФайла, Путь, ИмяФайла, Расширение) экспорт
	Результат = Неопределено;
	
	ВидРесурса = УправлениеКонтентом.ОпределитьРесурсПоРасширению(Расширение);
	
	ПутьКРодителю = СтрЗаменить(Путь, "\" + ИмяФайла, "");
	Родитель = Справочники.Ресурсы.НайтиПоРеквизиту("ПутьВеб", СтрЗаменить(ПутьКРодителю, "\", "/"));
	
	РесурсСсылка = Справочники.Ресурсы.НайтиПоРеквизиту("ПутьВеб", СтрЗаменить(Путь, "\", "/"));
	Если РесурсСсылка.Пустая() Тогда
		НовыйРесурс = Справочники.Ресурсы.СоздатьЭлемент();
	Иначе
		НовыйРесурс = РесурсСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	НовыйРесурс.Родитель = Родитель;
	НовыйРесурс.Наименование = ИмяФайла;
	НовыйРесурс.ВидРесурса = ВидРесурса;
	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
		НовыйРесурс.Файл = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных());
	КонецЕсли;
	
	Если ВидРесурса = ПредопределенноеЗначение("Перечисление.ВидыРесурса.Стиль") Тогда
		НовыйРесурс.Текст = ИзвлечьТекст(АдресФайла);
		НовыйРесурс.ТекстовыйФайл = Истина;
	КонецЕсли;
	
	НовыйРесурс.Записать();
	
	
	Возврат Результат;
КонецФункции

Функция ИзвлечьТекст(АдресФайла)
	Текст = "";
	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда 
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
		ИмяВремФайла = ПолучитьИмяВременногоФайла("tmp");
		ДвоичныеДанные.Записать(ИмяВремФайла);
		
		ТД = Новый ТекстовыйДокумент;
		ТД.Прочитать(ИмяВремФайла, КодировкаТекста.UTF8);
		Текст = ТД.ПолучитьТекст();
		
		УдалитьФайлы(ИмяВремФайла);
	КонецЕсли;
	Возврат Текст;
КонецФункции
